*** src/agent.rs:101:5: replace run -> Result<Outcome> with Ok(Default::default())

*** mutation diff:
--- src/agent.rs
+++ replace run -> Result<Outcome> with Ok(Default::default())
@@ -93,158 +93,10 @@
     pub max_turns: u32,
     pub timeout: Duration,
     pub log_path: &'a Path,
     pub sandbox: Option<&'a Sandbox>,
     pub report: &'a Reporter,
 }
 
 pub async fn run(l: Launch<'_>) -> Result<Outcome> {
-    let bin = agent_bin();
-    let argv: Vec<String> = [
-        bin.as_str(),
-        "--print",
-        "--verbose",
-        "--output-format",
-        "stream-json",
-        "--dangerously-skip-permissions",
-        "--model",
-        l.model,
-        "--max-turns",
-        &l.max_turns.to_string(),
-        "--json-schema",
-        crate::envelope::SCHEMA,
-    ]
-    .iter()
-    .map(|s| s.to_string())
-    .collect();
-    let identity = crate::git::identity(l.repo_git_dir).await;
-    let start = Instant::now();
-    let deadline = tokio::time::Instant::now() + l.timeout;
-    let mut child = Command::from(command_in(
-        l.sandbox,
-        l.worktree,
-        l.repo_git_dir,
-        &argv,
-        &identity,
-    ))
-    .stdin(Stdio::piped())
-    .stdout(Stdio::piped())
-    .stderr(Stdio::piped())
-    .kill_on_drop(true)
-    .spawn()
-    .with_context(|| format!("spawning {bin}"))?;
-
-    {
-        let mut stdin = child.stdin.take().context("agent stdin")?;
-        stdin.write_all(l.prompt.as_bytes()).await?;
-        stdin.shutdown().await?;
-    }
-    let stderr = child.stderr.take().context("agent stderr")?;
-    let stderr_task = tokio::spawn(async move {
-        let mut s = String::new();
-        BufReader::new(stderr).read_to_string(&mut s).await.ok();
-        s
-    });
-
-    let mut log =
-        File::create(l.log_path).with_context(|| format!("creating {}", l.log_path.display()))?;
-    writeln!(
-        log,
-        "{{\"type\":\"forge_prompt\",\"text\":{}}}",
-        serde_json::to_string(l.prompt)?
-    )?;
-    let mut out = Outcome::default();
-    let mut seen_tools: HashSet<String> = HashSet::new();
-    let stdout = child.stdout.take().context("agent stdout")?;
-    let mut lines = BufReader::new(stdout).lines();
-
-    let read = async {
-        while let Some(line) = lines.next_line().await? {
-            writeln!(log, "{line}")?;
-            let Ok(v) = serde_json::from_str::<Value>(&line) else {
-                continue;
-            };
-            match v["type"].as_str() {
-                Some("assistant") => {
-                    // The CLI repeats a message once per content block; count
-                    // each tool_use id once.
-                    if let Some(blocks) = v["message"]["content"].as_array() {
-                        for b in blocks {
-                            if b["type"] == "tool_use" {
-                                let id = b["id"].as_str().unwrap_or("").to_string();
-                                if seen_tools.insert(id) {
-                                    out.tool_calls += 1;
-                                    l.report.emit(
-                                        l.task_id,
-                                        Event::ToolCall {
-                                            name: b["name"].as_str().unwrap_or("?"),
-                                        },
-                                    );
-                                }
-                            }
-                        }
-                    }
-                }
-                Some("result") => {
-                    out.got_result = true;
-                    out.is_error = v["is_error"].as_bool().unwrap_or(false);
-                    out.num_turns = v["num_turns"].as_i64().unwrap_or(0);
-                    out.cost_usd = v["total_cost_usd"].as_f64();
-                    out.result_text = v["result"].as_str().unwrap_or("").to_string();
-                    out.structured = match &v["structured_output"] {
-                        Value::Null => None,
-                        other => Some(other.to_string()),
-                    };
-                }
-                Some("rate_limit_event") => {
-                    let w = &v["rate_limit_info"]["unifiedWindows"];
-                    let read = |name: &str| {
-                        let win = &w[name];
-                        Some((
-                            win["utilization"].as_f64()?,
-                            win["resetsAt"].as_i64().unwrap_or(0),
-                        ))
-                    };
-                    if let Some(s) = read("five_hour") {
-                        out.rate_limits.five_hour = Some(s);
-                    }
-                    if let Some(s) = read("seven_day") {
-                        out.rate_limits.seven_day = Some(s);
-                    }
-                }
-                _ => {}
-            }
-        }
-        Ok::<(), anyhow::Error>(())
-    };
-
-    match tokio::time::timeout_at(deadline, read).await {
-        Ok(r) => {
-            r?;
-            match tokio::time::timeout_at(deadline, child.wait()).await {
-                Ok(status) => out.exit_code = status?.code(),
-                Err(_) => out.timed_out = true,
-            }
-        }
-        Err(_) => out.timed_out = true,
-    }
-    if out.timed_out {
-        child.kill().await.ok();
-        child.wait().await.ok();
-        writeln!(
-            log,
-            "{{\"type\":\"forge_timeout\",\"after_secs\":{}}}",
-            l.timeout.as_secs()
-        )?;
-    }
-    out.wall_ms = start.elapsed().as_millis();
-
-    let stderr_text = stderr_task.await.unwrap_or_default();
-    if !stderr_text.trim().is_empty() {
-        writeln!(
-            log,
-            "{{\"type\":\"forge_stderr\",\"text\":{}}}",
-            serde_json::to_string(&stderr_text)?
-        )?;
-    }
-    Ok(out)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }

---- a_false_claim_of_a_passing_check_fails_l1 stdout ----
--- forge run /tmp/.tmpeUlBj5/repo write 42 to answer.txt --retries 0 ---
task     1
worktree /tmp/.tmpeUlBj5/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ 4b145e8e)
agent    sonnet, max 30 turns, max 1 attempts, 1800s timeout, sandboxed
--- attempt 1 of 1
agent    exit signal · 0 turns · 0 tool calls · 0.0s · cost n/a
git      0 commit(s), 0 file(s) changed
attempt  agent_failed: agent exit signal

---- a_hanging_agent_is_killed_at_the_timeout stdout ----
--- forge run /tmp/.tmpFXL6lC/repo write 42 to answer.txt --retries 0 --timeout-secs 2 ---
task     1
worktree /tmp/.tmpFXL6lC/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ 4b145e8e)
agent    sonnet, max 30 turns, max 1 attempts, 2s timeout, sandboxed
--- attempt 1 of 1
agent    exit signal · 0 turns · 0 tool calls · 0.0s · cost n/a
git      0 commit(s), 0 file(s) changed
attempt  agent_failed: agent exit signal

---- a_check_that_backgrounds_a_server_does_not_hang stdout ----
--- forge run /tmp/.tmpIaU8co/repo write 42 to answer.txt --retries 0 ---
task     1
worktree /tmp/.tmpIaU8co/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ b06fb117)
agent    sonnet, max 30 turns, max 1 attempts, 1800s timeout, sandboxed
--- attempt 1 of 1
agent    exit signal · 0 turns · 0 tool calls · 0.0s · cost n/a
git      0 commit(s), 0 file(s) changed
attempt  agent_failed: agent exit signal

failures:
    a_check_that_backgrounds_a_server_does_not_hang
    a_crashing_agent_is_retried_then_fails
    a_dirty_tree_fails_l0
    a_false_claim_of_a_passing_check_fails_l1
    a_hanging_agent_is_killed_at_the_timeout
    a_question_ends_the_task_without_retrying
    a_second_signal_aborts_and_requeues
    an_environment_fault_requeues_and_stops_the_worker
    an_orphaned_task_is_requeued_and_resumes_at_the_next_attempt
    an_unreported_change_fails_l0
    daily_budget_stops_the_worker
    doctor_runs_and_reports_the_essentials

test result: FAILED. 2 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.51s

*** result: Failure(101)
