*** src/agent.rs:121:48: replace + with - in run

*** mutation diff:
--- src/agent.rs
+++ replace + with - in run
@@ -113,17 +113,17 @@
         "--json-schema",
         crate::envelope::SCHEMA,
     ]
     .iter()
     .map(|s| s.to_string())
     .collect();
     let identity = crate::git::identity(l.repo_git_dir).await;
     let start = Instant::now();
-    let deadline = tokio::time::Instant::now() + l.timeout;
+    let deadline = tokio::time::Instant::now() - /* ~ changed by cargo-mutants ~ */ l.timeout;
     let mut child = Command::from(command_in(
         l.sandbox,
         l.worktree,
         l.repo_git_dir,
         &argv,
         &identity,
     ))
     .stdin(Stdio::piped())

*** result: Timeout
