*** src/agent.rs:175:52: replace += with -= in run

*** mutation diff:
--- src/agent.rs
+++ replace += with -= in run
@@ -167,17 +167,17 @@
                 Some("assistant") => {
                     // The CLI repeats a message once per content block; count
                     // each tool_use id once.
                     if let Some(blocks) = v["message"]["content"].as_array() {
                         for b in blocks {
                             if b["type"] == "tool_use" {
                                 let id = b["id"].as_str().unwrap_or("").to_string();
                                 if seen_tools.insert(id) {
-                                    out.tool_calls += 1;
+                                    out.tool_calls -= /* ~ changed by cargo-mutants ~ */ 1;
                                     l.report.emit(
                                         l.task_id,
                                         Event::ToolCall {
                                             name: b["name"].as_str().unwrap_or("?"),
                                         },
                                     );
                                 }
                             }

*** result: Success
