*** src/agent.rs:187:17: delete match arm Some("result") in run

*** mutation diff:
--- src/agent.rs
+++ delete match arm Some("result") in run
@@ -179,27 +179,17 @@
                                             name: b["name"].as_str().unwrap_or("?"),
                                         },
                                     );
                                 }
                             }
                         }
                     }
                 }
-                Some("result") => {
-                    out.got_result = true;
-                    out.is_error = v["is_error"].as_bool().unwrap_or(false);
-                    out.num_turns = v["num_turns"].as_i64().unwrap_or(0);
-                    out.cost_usd = v["total_cost_usd"].as_f64();
-                    out.result_text = v["result"].as_str().unwrap_or("").to_string();
-                    out.structured = match &v["structured_output"] {
-                        Value::Null => None,
-                        other => Some(other.to_string()),
-                    };
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Some("rate_limit_event") => {
                     let w = &v["rate_limit_info"]["unifiedWindows"];
                     let read = |name: &str| {
                         let win = &w[name];
                         Some((
                             win["utilization"].as_f64()?,
                             win["resetsAt"].as_i64().unwrap_or(0),
                         ))

---- a_check_that_backgrounds_a_server_does_not_hang stdout ----
--- forge run /tmp/.tmpY97jx0/repo write 42 to answer.txt --retries 0 ---
task     1
worktree /tmp/.tmpY97jx0/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ f67ffbe1)
agent    sonnet, max 30 turns, max 1 attempts, 1800s timeout, sandboxed
--- attempt 1 of 1
  ▸ Write
agent    exit 0 · 0 turns · 1 tool calls · 0.0s · cost n/a
git      1 commit(s), 1 file(s) changed
attempt  agent_failed: agent produced no result

---- a_false_claim_of_a_passing_check_fails_l1 stdout ----
--- forge run /tmp/.tmpM7lBWM/repo write 42 to answer.txt --retries 0 ---
task     1
worktree /tmp/.tmpM7lBWM/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ 1d11c570)
agent    sonnet, max 30 turns, max 1 attempts, 1800s timeout, sandboxed
--- attempt 1 of 1
agent    exit 0 · 0 turns · 0 tool calls · 0.0s · cost n/a
git      1 commit(s), 1 file(s) changed
attempt  agent_failed: agent produced no result

---- a_dirty_tree_fails_l0 stdout ----
--- forge run /tmp/.tmpC5dLK7/repo write 42 to answer.txt --retries 0 ---
task     1
worktree /tmp/.tmpC5dLK7/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ 1d11c570)
agent    sonnet, max 30 turns, max 1 attempts, 1800s timeout, sandboxed
--- attempt 1 of 1
agent    exit 0 · 0 turns · 0 tool calls · 0.0s · cost n/a
git      1 commit(s), 1 file(s) changed, UNCOMMITTED changes left behind
attempt  agent_failed: agent produced no result

failures:
    a_check_that_backgrounds_a_server_does_not_hang
    a_dirty_tree_fails_l0
    a_false_claim_of_a_passing_check_fails_l1
    a_question_ends_the_task_without_retrying
    an_orphaned_task_is_requeued_and_resumes_at_the_next_attempt
    an_unreported_change_fails_l0
    daily_budget_stops_the_worker
    doctor_runs_and_reports_the_essentials
    failing_tests_are_named_in_the_feedback
    gc_removes_only_what_is_published_and_clean
    jobs_run_in_parallel
    l1_failure_is_fed_to_the_next_attempt

test result: FAILED. 6 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.13s

*** result: Failure(101)
