*** src/agent.rs:198:17: delete match arm Some("rate_limit_event") in run

*** mutation diff:
--- src/agent.rs
+++ delete match arm Some("rate_limit_event") in run
@@ -190,32 +190,17 @@
                     out.num_turns = v["num_turns"].as_i64().unwrap_or(0);
                     out.cost_usd = v["total_cost_usd"].as_f64();
                     out.result_text = v["result"].as_str().unwrap_or("").to_string();
                     out.structured = match &v["structured_output"] {
                         Value::Null => None,
                         other => Some(other.to_string()),
                     };
                 }
-                Some("rate_limit_event") => {
-                    let w = &v["rate_limit_info"]["unifiedWindows"];
-                    let read = |name: &str| {
-                        let win = &w[name];
-                        Some((
-                            win["utilization"].as_f64()?,
-                            win["resetsAt"].as_i64().unwrap_or(0),
-                        ))
-                    };
-                    if let Some(s) = read("five_hour") {
-                        out.rate_limits.five_hour = Some(s);
-                    }
-                    if let Some(s) = read("seven_day") {
-                        out.rate_limits.seven_day = Some(s);
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
         }
         Ok::<(), anyhow::Error>(())
     };
 
     match tokio::time::timeout_at(deadline, read).await {
         Ok(r) => {

---- doctor_runs_and_reports_the_essentials stdout ----
--- forge run /tmp/.tmpht2ER2/repo write 42 to answer.txt ---
task     1
worktree /tmp/.tmpht2ER2/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ cce57ede)
agent    sonnet, max 30 turns, max 2 attempts, 1800s timeout, sandboxed
--- attempt 1 of 2
  ▸ Write
agent    exit 0 · 2 turns · 1 tool calls · 0.0s · $0.0100
git      1 commit(s), 1 file(s) changed
  ✓ L0 result-structured (0.0s)
  ✓ L0 clean-tree (0.0s)
  ✓ L0 forge.toml-untouched (0.0s)
  ✓ L0 has-commits (0.0s)

---- success_is_verified_at_l0_and_l1_and_pushed stdout ----
--- forge run /tmp/.tmpd6MUPf/repo write 42 to answer.txt ---
task     1
worktree /tmp/.tmpd6MUPf/home/worktrees/1
branch   forge/1-write-42-to-answertxt (from main @ cce57ede)
agent    sonnet, max 30 turns, max 2 attempts, 1800s timeout, sandboxed
--- attempt 1 of 2
  ▸ Write
agent    exit 0 · 2 turns · 1 tool calls · 0.0s · $0.0100
git      1 commit(s), 1 file(s) changed
  ✓ L0 result-structured (0.0s)
  ✓ L0 clean-tree (0.0s)
  ✓ L0 forge.toml-untouched (0.0s)
  ✓ L0 has-commits (0.0s)

failures:
    doctor_runs_and_reports_the_essentials
    success_is_verified_at_l0_and_l1_and_pushed

test result: FAILED. 23 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.52s

*** result: Failure(101)
