*** src/agent.rs:242:8: delete ! in run

*** mutation diff:
--- src/agent.rs
+++ delete ! in run
@@ -234,17 +234,17 @@
             log,
             "{{\"type\":\"forge_timeout\",\"after_secs\":{}}}",
             l.timeout.as_secs()
         )?;
     }
     out.wall_ms = start.elapsed().as_millis();
 
     let stderr_text = stderr_task.await.unwrap_or_default();
-    if !stderr_text.trim().is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */stderr_text.trim().is_empty() {
         writeln!(
             log,
             "{{\"type\":\"forge_stderr\",\"text\":{}}}",
             serde_json::to_string(&stderr_text)?
         )?;
     }
     Ok(out)
 }

*** result: Success
