*** src/agent.rs:47:5: replace agent_bin -> String with String::new()

*** mutation diff:
--- src/agent.rs
+++ replace agent_bin -> String with String::new()
@@ -39,17 +39,17 @@
 /// the notional dollar figure, is the real budget.
 #[derive(Default, Debug, Clone, Copy)]
 pub struct RateLimits {
     pub five_hour: Option<(f64, i64)>,
     pub seven_day: Option<(f64, i64)>,
 }
 
 pub fn agent_bin() -> String {
-    std::env::var("FORGE2_CLAUDE_BIN").unwrap_or_else(|_| "claude".to_string())
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The environment the agent and the checks see, sandboxed or not. This is
 /// the one list; the sandbox overrides HOME on top of it.
 pub fn agent_env() -> Vec<(String, String)> {
     std::env::vars()
         .filter(|(k, _)| {
             matches!(

---- a_crashing_agent_is_retried_then_fails stdout ----
--- forge run /tmp/.tmpWxOViQ/repo write 42 to answer.txt --retries 1 ---
Error:  not found in PATH


thread 'a_crashing_agent_is_retried_then_fails' (595135) panicked at tests/e2e.rs:455:5:
assertion `left == right` failed
  left: 0
 right: 2

---- a_question_ends_the_task_without_retrying stdout ----
--- forge run /tmp/.tmpq2BGAO/repo write 42 to answer.txt --retries 2 ---
Error:  not found in PATH


thread 'a_question_ends_the_task_without_retrying' (595140) panicked at tests/e2e.rs:240:5:
assertion `left == right` failed: retrying cannot answer a question
  left: 0
 right: 1

---- a_false_claim_of_a_passing_check_fails_l1 stdout ----
--- forge run /tmp/.tmpYkCgMA/repo write 42 to answer.txt --retries 0 ---
Error:  not found in PATH


thread 'a_false_claim_of_a_passing_check_fails_l1' (595137) panicked at tests/e2e.rs:226:17:
index out of bounds: the len is 0 but the index is 0

failures:
    a_check_that_backgrounds_a_server_does_not_hang
    a_crashing_agent_is_retried_then_fails
    a_dirty_tree_fails_l0
    a_false_claim_of_a_passing_check_fails_l1
    a_hanging_agent_is_killed_at_the_timeout
    a_question_ends_the_task_without_retrying
    a_second_signal_aborts_and_requeues
    an_environment_fault_requeues_and_stops_the_worker
    an_orphaned_task_is_requeued_and_resumes_at_the_next_attempt
    an_unreported_change_fails_l0
    daily_budget_stops_the_worker
    doctor_runs_and_reports_the_essentials

test result: FAILED. 2 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.52s

*** result: Failure(101)
