*** src/agent.rs:47:5: replace agent_bin -> String with "xyzzy".into()

*** mutation diff:
--- src/agent.rs
+++ replace agent_bin -> String with "xyzzy".into()
@@ -39,17 +39,17 @@
 /// the notional dollar figure, is the real budget.
 #[derive(Default, Debug, Clone, Copy)]
 pub struct RateLimits {
     pub five_hour: Option<(f64, i64)>,
     pub seven_day: Option<(f64, i64)>,
 }
 
 pub fn agent_bin() -> String {
-    std::env::var("FORGE2_CLAUDE_BIN").unwrap_or_else(|_| "claude".to_string())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The environment the agent and the checks see, sandboxed or not. This is
 /// the one list; the sandbox overrides HOME on top of it.
 pub fn agent_env() -> Vec<(String, String)> {
     std::env::vars()
         .filter(|(k, _)| {
             matches!(

---- a_dirty_tree_fails_l0 stdout ----
--- forge run /tmp/.tmpAiyl2T/repo write 42 to answer.txt --retries 0 ---
Error: xyzzy not found in PATH


thread 'a_dirty_tree_fails_l0' (596512) panicked at tests/e2e.rs:424:22:
index out of bounds: the len is 0 but the index is 0

---- a_false_claim_of_a_passing_check_fails_l1 stdout ----
--- forge run /tmp/.tmpi1Tbze/repo write 42 to answer.txt --retries 0 ---
Error: xyzzy not found in PATH


thread 'a_false_claim_of_a_passing_check_fails_l1' (596513) panicked at tests/e2e.rs:226:17:
index out of bounds: the len is 0 but the index is 0

---- a_hanging_agent_is_killed_at_the_timeout stdout ----
--- forge run /tmp/.tmp0L3yp4/repo write 42 to answer.txt --retries 0 --timeout-secs 2 ---
Error: xyzzy not found in PATH


thread 'a_hanging_agent_is_killed_at_the_timeout' (596514) panicked at tests/e2e.rs:445:14:
index out of bounds: the len is 0 but the index is 0

failures:
    a_check_that_backgrounds_a_server_does_not_hang
    a_crashing_agent_is_retried_then_fails
    a_dirty_tree_fails_l0
    a_false_claim_of_a_passing_check_fails_l1
    a_hanging_agent_is_killed_at_the_timeout
    a_question_ends_the_task_without_retrying
    a_second_signal_aborts_and_requeues
    an_environment_fault_requeues_and_stops_the_worker
    an_orphaned_task_is_requeued_and_resumes_at_the_next_attempt
    an_unreported_change_fails_l0
    daily_budget_stops_the_worker
    doctor_runs_and_reports_the_essentials

test result: FAILED. 2 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.52s

*** result: Failure(101)
