*** src/agent.rs:53:5: replace agent_env -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]

*** mutation diff:
--- src/agent.rs
+++ replace agent_env -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]
@@ -45,24 +45,17 @@
 
 pub fn agent_bin() -> String {
     std::env::var("FORGE2_CLAUDE_BIN").unwrap_or_else(|_| "claude".to_string())
 }
 
 /// The environment the agent and the checks see, sandboxed or not. This is
 /// the one list; the sandbox overrides HOME on top of it.
 pub fn agent_env() -> Vec<(String, String)> {
-    std::env::vars()
-        .filter(|(k, _)| {
-            matches!(
-                k.as_str(),
-                "PATH" | "HOME" | "LANG" | "TERM" | "CLAUDE_CONFIG_DIR"
-            ) || ["LC_", "ANTHROPIC_"].iter().any(|p| k.starts_with(p))
-        })
-        .collect()
+    vec![("xyzzy".into(), "xyzzy".into())] /* ~ changed by cargo-mutants ~ */
 }
 
 /// A command for `argv` in the worktree, through the sandbox when there is
 /// one, with the agent environment plus `extra_env`.
 pub fn command_in(
     sandbox: Option<&Sandbox>,
     worktree: &Path,
     repo_git_dir: &Path,

*** result: Success
