*** src/checks.rs:24:30: replace * with /

*** mutation diff:
--- src/checks.rs
+++ replace * with /
@@ -16,17 +16,17 @@
 use std::process::Stdio;
 use std::sync::{Arc, Mutex};
 use std::time::{Duration, Instant};
 use tokio::io::AsyncReadExt;
 use tokio::process::Command;
 
 /// How much of a check's output Forge keeps: the tail, which is where a
 /// test runner puts its failures.
-const TAIL_BYTES: usize = 16 * 1024;
+const TAIL_BYTES: usize = 16 / /* ~ changed by cargo-mutants ~ */ 1024;
 const DRAIN_GRACE: Duration = Duration::from_secs(2);
 
 #[derive(Serialize, Deserialize, Debug, Clone, Default)]
 pub struct CheckResult {
     pub level: String,
     pub name: String,
     pub ok: bool,
     pub exit: Option<i32>,

---- checks::tests::tail_keeps_only_the_end stdout ----

thread 'checks::tests::tail_keeps_only_the_end' (634029) panicked at src/checks.rs:213:9:
assertion failed: s.ends_with("END")

---- checks::tests::a_backgrounded_child_does_not_hold_the_check_open stdout ----

thread 'checks::tests::a_backgrounded_child_does_not_hold_the_check_open' (634027) panicked at src/checks.rs:242:9:

failures:
    checks::tests::a_backgrounded_child_does_not_hold_the_check_open
    checks::tests::tail_keeps_only_the_end

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
