*** src/checks.rs:46:9: replace Tail::write with ()

*** mutation diff:
--- src/checks.rs
+++ replace Tail::write with ()
@@ -38,21 +38,17 @@
 }
 
 /// Keeps the last `TAIL_BYTES` written to it.
 #[derive(Default)]
 struct Tail(Vec<u8>);
 
 impl Tail {
     fn write(&mut self, chunk: &[u8]) {
-        self.0.extend_from_slice(chunk);
-        if self.0.len() > TAIL_BYTES {
-            let cut = self.0.len() - TAIL_BYTES;
-            self.0.drain(..cut);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
     fn string(&self) -> String {
         String::from_utf8_lossy(&self.0).into_owned()
     }
 }
 
 async fn drain(mut r: impl AsyncReadExt + Unpin, tail: Arc<Mutex<Tail>>) {
     let mut buf = [0u8; 8192];

---- checks::tests::tail_keeps_only_the_end stdout ----

thread 'checks::tests::tail_keeps_only_the_end' (634690) panicked at src/checks.rs:208:9:
assertion `left == right` failed
  left: 0
 right: 16384

---- checks::tests::a_backgrounded_child_does_not_hold_the_check_open stdout ----

thread 'checks::tests::a_backgrounded_child_does_not_hold_the_check_open' (634688) panicked at src/checks.rs:238:9:

failures:
    checks::tests::a_backgrounded_child_does_not_hold_the_check_open
    checks::tests::tail_keeps_only_the_end

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
