*** src/checks.rs:48:36: replace - with + in Tail::write

*** mutation diff:
--- src/checks.rs
+++ replace - with + in Tail::write
@@ -40,17 +40,17 @@
 /// Keeps the last `TAIL_BYTES` written to it.
 #[derive(Default)]
 struct Tail(Vec<u8>);
 
 impl Tail {
     fn write(&mut self, chunk: &[u8]) {
         self.0.extend_from_slice(chunk);
         if self.0.len() > TAIL_BYTES {
-            let cut = self.0.len() - TAIL_BYTES;
+            let cut = self.0.len() + /* ~ changed by cargo-mutants ~ */ TAIL_BYTES;
             self.0.drain(..cut);
         }
     }
     fn string(&self) -> String {
         String::from_utf8_lossy(&self.0).into_owned()
     }
 }

---- checks::tests::tail_keeps_only_the_end stdout ----

thread 'checks::tests::tail_keeps_only_the_end' (638088) panicked at /rustc/01f6ddf7588f42ae2d7eb0a2f21d44e8e96674cf/library/alloc/src/vec/mod.rs:2796:36:
range end index 32771 out of range for slice of length 16387

failures:
    checks::tests::tail_keeps_only_the_end

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
