*** src/checks.rs:53:9: replace Tail::string -> String with "xyzzy".into()

*** mutation diff:
--- src/checks.rs
+++ replace Tail::string -> String with "xyzzy".into()
@@ -45,17 +45,17 @@
     fn write(&mut self, chunk: &[u8]) {
         self.0.extend_from_slice(chunk);
         if self.0.len() > TAIL_BYTES {
             let cut = self.0.len() - TAIL_BYTES;
             self.0.drain(..cut);
         }
     }
     fn string(&self) -> String {
-        String::from_utf8_lossy(&self.0).into_owned()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 async fn drain(mut r: impl AsyncReadExt + Unpin, tail: Arc<Mutex<Tail>>) {
     let mut buf = [0u8; 8192];
     while let Ok(n) = r.read(&mut buf).await {
         if n == 0 {
             break;

---- checks::tests::tail_keeps_only_the_end stdout ----

thread 'checks::tests::tail_keeps_only_the_end' (640425) panicked at src/checks.rs:212:9:
assertion `left == right` failed
  left: 5
 right: 16384

---- checks::tests::a_backgrounded_child_does_not_hold_the_check_open stdout ----

thread 'checks::tests::a_backgrounded_child_does_not_hold_the_check_open' (640423) panicked at src/checks.rs:242:9:
xyzzy

failures:
    checks::tests::a_backgrounded_child_does_not_hold_the_check_open
    checks::tests::tail_keeps_only_the_end

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
