*** src/checks.rs:58:5: replace drain with ()

*** mutation diff:
--- src/checks.rs
+++ replace drain with ()
@@ -50,25 +50,17 @@
         }
     }
     fn string(&self) -> String {
         String::from_utf8_lossy(&self.0).into_owned()
     }
 }
 
 async fn drain(mut r: impl AsyncReadExt + Unpin, tail: Arc<Mutex<Tail>>) {
-    let mut buf = [0u8; 8192];
-    while let Ok(n) = r.read(&mut buf).await {
-        if n == 0 {
-            break;
-        }
-        tail.lock()
-            .unwrap_or_else(|p| p.into_inner())
-            .write(&buf[..n]);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Test names from the formats Forge recognises; unknown output yields
 /// nothing rather than a guess.
 pub fn failing_tests(out: &str) -> Vec<String> {
     let mut names = Vec::new();
     for line in out.lines().map(str::trim) {
         if let Some(rest) = line.strip_prefix("--- FAIL: ") {

---- checks::tests::a_backgrounded_child_does_not_hold_the_check_open stdout ----

thread 'checks::tests::a_backgrounded_child_does_not_hold_the_check_open' (641001) panicked at src/checks.rs:232:9:
assertion `left == right` failed
  left: None
 right: Some(3)

failures:
    checks::tests::a_backgrounded_child_does_not_hold_the_check_open

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
