*** src/checks.rs:60:14: replace == with != in drain

*** mutation diff:
--- src/checks.rs
+++ replace == with != in drain
@@ -52,17 +52,17 @@
     fn string(&self) -> String {
         String::from_utf8_lossy(&self.0).into_owned()
     }
 }
 
 async fn drain(mut r: impl AsyncReadExt + Unpin, tail: Arc<Mutex<Tail>>) {
     let mut buf = [0u8; 8192];
     while let Ok(n) = r.read(&mut buf).await {
-        if n == 0 {
+        if n != /* ~ changed by cargo-mutants ~ */ 0 {
             break;
         }
         tail.lock()
             .unwrap_or_else(|p| p.into_inner())
             .write(&buf[..n]);
     }
 }

---- checks::tests::a_backgrounded_child_does_not_hold_the_check_open stdout ----

thread 'checks::tests::a_backgrounded_child_does_not_hold_the_check_open' (641707) panicked at src/checks.rs:242:9:

failures:
    checks::tests::a_backgrounded_child_does_not_hold_the_check_open

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.01s

*** result: Failure(101)
