*** src/checks.rs:72:5: replace failing_tests -> Vec<String> with vec![String::new()]

*** mutation diff:
--- src/checks.rs
+++ replace failing_tests -> Vec<String> with vec![String::new()]
@@ -64,34 +64,17 @@
             .unwrap_or_else(|p| p.into_inner())
             .write(&buf[..n]);
     }
 }
 
 /// Test names from the formats Forge recognises; unknown output yields
 /// nothing rather than a guess.
 pub fn failing_tests(out: &str) -> Vec<String> {
-    let mut names = Vec::new();
-    for line in out.lines().map(str::trim) {
-        if let Some(rest) = line.strip_prefix("--- FAIL: ") {
-            // go test
-            if let Some(n) = rest.split_whitespace().next() {
-                names.push(n.to_string());
-            }
-        } else if let Some(rest) = line.strip_prefix("FAILED ").filter(|r| r.contains("::")) {
-            // pytest
-            if let Some(n) = rest.split_whitespace().next() {
-                names.push(n.to_string());
-            }
-        } else if let Some(rest) = line.strip_prefix("✕ ").or_else(|| line.strip_prefix("✗ ")) {
-            // jest
-            names.push(rest.trim().to_string());
-        }
-    }
-    names
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn run_one(
     level: &str,
     name: &str,
     argv: &[String],
     cwd: &Path,
     repo_git_dir: &Path,

---- checks::tests::extracts_go_pytest_and_jest_failures_only stdout ----

thread 'checks::tests::extracts_go_pytest_and_jest_failures_only' (642838) panicked at src/checks.rs:178:9:
assertion `left == right` failed
  left: [""]
 right: ["TestA", "tests/test_x.py::test_one", "renders the header (12 ms)"]

failures:
    checks::tests::extracts_go_pytest_and_jest_failures_only

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
