*** src/main.rs:33:5: replace main -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- src/main.rs
+++ replace main -> anyhow::Result<()> with Ok(())
@@ -25,10 +25,10 @@
     SystemTime::now()
         .duration_since(UNIX_EPOCH)
         .map(|d| d.as_secs() as i64)
         .unwrap_or(0)
 }
 
 #[tokio::main]
 async fn main() -> anyhow::Result<()> {
-    cli::main().await
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- a_crashing_agent_is_retried_then_fails stdout ----
--- forge run /tmp/.tmpElv8it/repo write 42 to answer.txt --retries 1 ---


thread 'a_crashing_agent_is_retried_then_fails' (592940) panicked at tests/e2e.rs:453:5:
assertion failed: !e.run("crash.sh", &["--retries", "1"]).status.success()

---- a_question_ends_the_task_without_retrying stdout ----
--- forge run /tmp/.tmpkb1hVb/repo write 42 to answer.txt --retries 2 ---


thread 'a_question_ends_the_task_without_retrying' (592966) panicked at tests/e2e.rs:238:5:
assertion failed: !e.run("needsinput.sh", &["--retries", "2"]).status.success()

---- a_missing_agent_binary_fails_fast_with_nothing_claimed stdout ----
--- forge add /tmp/.tmpyY0rzj/repo write 42 to answer.txt ---


thread 'a_missing_agent_binary_fails_fast_with_nothing_claimed' (592965) panicked at tests/e2e.rs:113:14:
called `Option::unwrap()` on a `None` value

failures:
    a_check_that_backgrounds_a_server_does_not_hang
    a_crashing_agent_is_retried_then_fails
    a_dirty_tree_fails_l0
    a_false_claim_of_a_passing_check_fails_l1
    a_hanging_agent_is_killed_at_the_timeout
    a_missing_agent_binary_fails_fast_with_nothing_claimed
    a_question_ends_the_task_without_retrying
    a_second_signal_aborts_and_requeues
    a_task_nothing_would_verify_is_refused
    an_environment_fault_requeues_and_stops_the_worker
    an_orphaned_task_is_requeued_and_resumes_at_the_next_attempt
    an_unreported_change_fails_l0

test result: FAILED. 0 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
